Revit 2027 API
Categories.Size Property
The total number of top-level categories in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override int Size { get; }
Public Overrides ReadOnly Property Size As Integer
	Get
public:
virtual property int Size {
	int get () override;
}
abstract Size : int with get
override Size : int with get
Property Value
Int32
See Also
Reference
Categories Class
Autodesk.Revit.DB Namespace